src/InformationRegisters/МеткиКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>МеткиКлиентов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Активна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Метка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СтатусыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтатусыКонтрагентов</Name>
			<Comment>Статусы пациентов</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Потенциальный</Name>
					<Comment>Потенциальный клиент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Первичный</Name>
					<Comment>Новый пациент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВернувшийся</Name>
					<Comment>Невернувшийся пациент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Постоянный</Name>
					<Comment>Постоянный клиент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Метки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Метки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦветМетки</Name>
					<Comment>Цвет метки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляПациентов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляПредварительнойЗаписи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекстаБелый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/МеткиКлиентов/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Функция вернет метки клиента и комментарии к ним.
// ОбъектВыборки - Массив, Событие, Контрагент - Объект выборки для которого отбираются метки.
// Период - период отбора
// ТолькоБлокирующиеМетки - выбрать только метки блокирующие операции с клиентом
Функция ПолучитьМеткиКлиента(ОбъектВыборки, Период = Неопределено, МеткиДляСобытия = Ложь) Экспорт
	
	ЗапросВыборка = Новый Запрос();
	ЗапросВыборка.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлиентскиеМеткиСрезПоследних.Метка КАК Метка,
	|	КлиентскиеМеткиСрезПоследних.Клиент КАК ВладелецМетки,
	|	КлиентскиеМеткиСрезПоследних.Активна КАК Активна,
	|	Метки.ЦветМетки КАК ЦветМетки,
	|	Метки.ИспользоватьДляПациентов КАК МеткаПациента,
	|	Метки.ЦветТекстаБелый КАК ЦветТекстаБелый
	|ИЗ
	|	РегистрСведений.МеткиКлиентов.СрезПоследних(&Период, &УсловиеОбъектВыборки) КАК КлиентскиеМеткиСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Метки КАК Метки
	|		ПО КлиентскиеМеткиСрезПоследних.Метка = Метки.Ссылка
	|ГДЕ
	|	КлиентскиеМеткиСрезПоследних.Активна = ИСТИНА
	|	И &УсловиеМеткиДляСобытия
	|
	|УПОРЯДОЧИТЬ ПО
	|	КлиентскиеМеткиСрезПоследних.Метка";
	
	ЗапросВыборка.УстановитьПараметр("Период", ?(Период = Неопределено, ТекущаяДатаСеанса(), Период));
	
	Если ТипЗнч(ОбъектВыборки) = Тип("Массив") Тогда
		УсловиеОбъектВыборки = "Клиент В (&ОбъектВыборки)";	
	Иначе
		УсловиеОбъектВыборки = "Клиент = &ОбъектВыборки";	
	КонецЕсли;
	
	ЗапросВыборка.Текст = СтрЗаменить(ЗапросВыборка.Текст, "&УсловиеОбъектВыборки", УсловиеОбъектВыборки);
	ЗапросВыборка.УстановитьПараметр("ОбъектВыборки", ОбъектВыборки); 

	УсловиеМеткиДляСобытия = ?(МеткиДляСобытия, "Метки.ИспользоватьДляПредварительнойЗаписи", "ИСТИНА");
	ЗапросВыборка.Текст = СтрЗаменить(ЗапросВыборка.Текст, "&УсловиеМеткиДляСобытия", УсловиеМеткиДляСобытия);
	
	Возврат ЗапросВыборка.Выполнить().Выгрузить();
	
КонецФункции

// Функция - Получить активность метки клиента
//
// Параметры:
//  Клиент	 - 	 - 
//  Метка	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьАктивностьМеткиКлиента(Клиент, Метка)
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	МеткиКлиентов.Активна
	                      |ИЗ
	                      |	РегистрСведений.МеткиКлиентов КАК МеткиКлиентов
	                      |ГДЕ
	                      |	МеткиКлиентов.Клиент = &Клиент
	                      |	И МеткиКлиентов.Метка = &Метка");
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Метка", Метка);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Активна;
	Иначе
		Возврат Ложь;
	КонецЕсли;
			
КонецФункции

// Функция вернет метки клиента и комментарии к ним
// КлиентСсылка - клиент для которого отбираются метки
// Период - период отбора
// ТолькоБлокирующиеМетки - выбрать только метки блокирующие операции с клиентом
Функция ПолучитьАктивныеМеткиЗаписи(ПредварительнаяЗапись) Экспорт
	
	ЗапросВыборка = Новый Запрос("ВЫБРАТЬ
	                             |	МеткиКлиентов.Метка КАК Метка
	                             |ИЗ
	                             |	РегистрСведений.МеткиКлиентов КАК МеткиКлиентов
	                             |ГДЕ
	                             |	МеткиКлиентов.Активна = ИСТИНА
	                             |	И МеткиКлиентов.Клиент = &ПредварительнаяЗапись");
	
	ЗапросВыборка.УстановитьПараметр("ПредварительнаяЗапись",ПредварительнаяЗапись);
	
	Возврат  ЗапросВыборка.Выполнить().Выгрузить().ВыгрузитьКолонку("Метка");
	
КонецФункции

// Процедура - Перенести метки объекта
//
// Параметры:
//  ОбъектИсточник			 - 	 - 
//  ОбъектПриемник			 - 	 - 
//  УдалятьМеткиИсточника	 - 	 - 
//
Процедура ПеренестиМеткиОбъекта(ОбъектИсточник, ОбъектПриемник, УдалятьМеткиИсточника = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ОбъектИсточник) ИЛИ НЕ ЗначениеЗаполнено(ОбъектПриемник) Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектИсточник", ОбъектИсточник);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МеткиКлиентов.Период КАК Период,
	|	МеткиКлиентов.Клиент КАК Клиент,
	|	МеткиКлиентов.Метка КАК Метка,
	|	МеткиКлиентов.Активна КАК Активна,
	|	МеткиКлиентов.Автор КАК Автор
	|ИЗ
	|	РегистрСведений.МеткиКлиентов КАК МеткиКлиентов
	|ГДЕ
	|	МеткиКлиентов.Клиент = &ОбъектИсточник";
	
	ТаблицаМетокИсточника = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаМетка Из ТаблицаМетокИсточника Цикл 
		НаборМетокПриемник = СоздатьНаборЗаписей();
		НаборМетокПриемник.Отбор.Период.Установить(СтрокаМетка.Период);
		НаборМетокПриемник.Отбор.Клиент.Установить(ОбъектПриемник);
		НаборМетокПриемник.Отбор.Метка.Установить(СтрокаМетка.Метка);
		ЗаписьМеткаПриемник = НаборМетокПриемник.Добавить();
	    ЗаполнитьЗначенияСвойств(ЗаписьМеткаПриемник, СтрокаМетка);
	    ЗаписьМеткаПриемник.Клиент = ОбъектПриемник;
		НаборМетокПриемник.ОбменДанными.Загрузка = Истина;
		Попытка
			НаборМетокПриемник.Записать();
		Исключение
			
		КонецПопытки;
		
		Если УдалятьМеткиИсточника Тогда 
			НаборМетокИсточник = СоздатьНаборЗаписей();
			НаборМетокИсточник.Отбор.Период.Установить(СтрокаМетка.Период);
			НаборМетокИсточник.Отбор.Клиент.Установить(СтрокаМетка.Клиент);
			НаборМетокИсточник.Отбор.Метка.Установить(СтрокаМетка.Метка);
			НаборМетокИсточник.ОбменДанными.Загрузка = Истина;
			Попытка
				НаборМетокИсточник.Записать();
			Исключение
				
			КонецПопытки;			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
 
// Процедура, формирует динамические элементы меток.
//
Процедура СоздатьВизуальныеЭлементыМеток(ВладелецМетки, Форма, ГруппаЭлементов, СоздатьСсылкуРедактирования = Ложь) Экспорт
	
	ЭтоФормаКлиенты 		 = Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлементаКлиенты";
	СсылкаРеквизитСуществует = ?(ТипЗнч(Форма.Объект) = Тип("ДанныеФормыСтруктура")
									И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "Ссылка") = Истина, Истина, Ложь);
	СсылкаРеквизит = ?(СсылкаРеквизитСуществует, Форма.Объект.Ссылка, ВладелецМетки); 

	Если ТипЗнч(СсылкаРеквизит) = Тип("СправочникСсылка.Контрагенты")
		Или ТипЗнч(СсылкаРеквизит) = Тип("СправочникСсылка.Заявки")
		Или ТипЗнч(СсылкаРеквизит) = Тип("СправочникСсылка.Сделки")Тогда
		
		КоличествоМетокВСтроке = 6;
		
	ИначеЕсли ТипЗнч(СсылкаРеквизит) = Тип("ДокументСсылка.Событие") И СсылкаРеквизитСуществует = Истина Тогда
		КоличествоМетокВСтроке = 5;
		
	ИначеЕсли ТипЗнч(СсылкаРеквизит) = Тип("ДокументСсылка.Событие") И СсылкаРеквизитСуществует = Ложь Тогда
		КоличествоМетокВСтроке = 3;	
		
	Иначе 
		КоличествоМетокВСтроке = 9;
		
	КонецЕсли;
	
	Индекс = 0;
	// Удаляем элементы группы
	Пока Индекс < ГруппаЭлементов.ПодчиненныеЭлементы.Количество() Цикл
		Форма.Элементы.Удалить(ГруппаЭлементов.ПодчиненныеЭлементы[Индекс]);
	КонецЦикла;	
	
	Если Форма.Команды.Найти("ОтображатьМеткуПриНажатии") = Неопределено Тогда
		Команда			 = Форма.Команды.Добавить("ОтображатьМеткуПриНажатии");
		Команда.Действие = "Подключаемый_ОтображатьМеткуПриНажатии";
	КонецЕсли;
	
	ОбщаяДлинаСтроки 	= 0;
	ПолучитьНовуюСтроку = 0;
	КоличествоУстановленныхМеток = 0;
	
	Для Каждого Метка Из Форма.ТаблицаМеток Цикл
		
		Если СоздатьСсылкуРедактирования И Не Метка.Активна Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоУстановленныхМеток = КоличествоУстановленныхМеток + 1;
		
		Индекс = Метка.ПолучитьИдентификатор();
		
		Если ПолучитьНовуюСтроку = 0 Тогда
			Группа_Заглушка_НоваяСтрока						 = Форма.Элементы.Добавить("Группа_Заглушка_Строка" + Индекс, Тип("ГруппаФормы"), ГруппаЭлементов);
			Группа_Заглушка_НоваяСтрока.Вид					 = ВидГруппыФормы.ОбычнаяГруппа;
			Группа_Заглушка_НоваяСтрока.Отображение			 = ОтображениеОбычнойГруппы.Нет;
			Группа_Заглушка_НоваяСтрока.Группировка			 = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			Группа_Заглушка_НоваяСтрока.ОтображатьЗаголовок	 = Ложь;
		КонецЕсли;
		
		Группа_Заглушка_Выравнивания					 = Форма.Элементы.Добавить("Группа_Заглушка_Выравнивания" + Индекс, Тип("ГруппаФормы"), Группа_Заглушка_НоваяСтрока);
		Группа_Заглушка_Выравнивания.Вид				 = ВидГруппыФормы.ОбычнаяГруппа;
		Группа_Заглушка_Выравнивания.Отображение		 = ОтображениеОбычнойГруппы.Нет;
		Группа_Заглушка_Выравнивания.Группировка		 = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		Группа_Заглушка_Выравнивания.ОтображатьЗаголовок = Ложь;
		
		Группа_Заглушка_Метка						 = Форма.Элементы.Добавить("Группа_Заглушка_" + Индекс, Тип("ГруппаФормы"), Группа_Заглушка_Выравнивания);
		Группа_Заглушка_Метка.Вид					 = ВидГруппыФормы.ОбычнаяГруппа;
		Группа_Заглушка_Метка.Отображение			 = ОтображениеОбычнойГруппы.Нет;
		Группа_Заглушка_Метка.Группировка			 = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		Группа_Заглушка_Метка.ОтображатьЗаголовок	 = Ложь;
		Группа_Заглушка_Метка.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Одинарный;
		Группа_Заглушка_Метка.ЦветФона				 = ?(Метка.Активна, Метка.ЦветФона, Новый Цвет(255, 255, 255));
		
		КнопкаМ						 = Форма.Элементы.Добавить("КнопкаМ_" + Индекс, Тип("КнопкаФормы"), Группа_Заглушка_Метка);
		КнопкаМ.Заголовок			 = Метка.ПредставлениеМетки;
		КнопкаМ.ИмяКоманды			 = "ОтображатьМеткуПриНажатии";
		КнопкаМ.ОтображениеФигуры	 = ОтображениеФигурыКнопки.Нет;  
		КнопкаМ.ЦветТекста			 = ?(Метка.Активна И Метка.ЦветТекстаБелый, Новый Цвет(255, 255, 255), Новый Цвет(77, 77, 77));
		
		Если СтрДлина(КнопкаМ.Заголовок) < 19 Тогда
			КнопкаМ.РастягиватьПоВертикали = Ложь;
		КонецЕсли;
		ОбщаяДлинаСтроки = ОбщаяДлинаСтроки + СтрДлина(КнопкаМ.Заголовок);
		
		ПолучитьНовуюСтроку = ПолучитьНовуюСтроку + 1;
		Если ПолучитьНовуюСтроку = КоличествоМетокВСтроке ИЛИ (ЭтоФормаКлиенты И ОбщаяДлинаСтроки > 54) Тогда
			ОбщаяДлинаСтроки 	= 0;
			ПолучитьНовуюСтроку = 0;
		КонецЕсли;
		
	КонецЦикла;	
	
	// Размещаем ссылку редактирования меток
	Если СоздатьСсылкуРедактирования Тогда
		
		КнопкаМ				             = Форма.Элементы.Добавить("ДекорацияМ_Редактирование", Тип("ДекорацияФормы"), ГруппаЭлементов);
		КнопкаМ.Заголовок				 = ?(КоличествоУстановленныхМеток, НСтр("ru = 'Изменить'"), НСтр("ru = 'Присвоить метки'"));
		КнопкаМ.Гиперссылка				 = Истина;
		КнопкаМ.РастягиватьПоГоризонтали = Истина;
        КнопкаМ.УстановитьДействие("Нажатие", "ОбработчикРедактированияМеток");
		
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает набор меток, предназначенных для клиентов и предварительных записей.
//
Функция ПолучитьНаборМеток(МеткаКлиента = Ложь, ТЗИсключающихМеток = Неопределено, ОбъединитьТЗ = Ложь) Экспорт
		
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	Метки.Ссылка КАК Метка,
	                      |	Метки.ЦветМетки КАК ЦветМетки,
	                      |	ЛОЖЬ КАК Активна,
	                      |	ЛОЖЬ КАК МеткаПациента,
	                      |	Метки.ЦветТекстаБелый КАК ЦветТекстаБелый
	                      |ИЗ
	                      |	Справочник.Метки КАК Метки
	                      |ГДЕ
	                      |	ВЫБОР
	                      |			КОГДА &МеткаКлиента
	                      |				ТОГДА Метки.ИспользоватьДляПациентов
	                      |			ИНАЧЕ Метки.ИспользоватьДляПредварительнойЗаписи
	                      |		КОНЕЦ
	                      |	И ВЫБОР
	                      |			КОГДА &ИспользоватьИсключенные
	                      |				ТОГДА НЕ Метки.Ссылка В (&МассивИсключенных)
	                      |			ИНАЧЕ ИСТИНА
	                      |		КОНЕЦ
	                      |	И НЕ Метки.ПометкаУдаления
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Метки.Ссылка");
	
	Запрос.УстановитьПараметр("МеткаКлиента", МеткаКлиента);
	Запрос.УстановитьПараметр("ИспользоватьИсключенные", ЗначениеЗаполнено(ТЗИсключающихМеток));
	
	Если НЕ ЗначениеЗаполнено(ТЗИсключающихМеток) Тогда
		ТЗИсключающихМеток = Новый Массив;
	Иначе
		ТЗИсключающихМеток.ВыгрузитьКолонку("Метка");	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивИсключенных", ТЗИсключающихМеток);
	
	Если ОбъединитьТЗ И ЗначениеЗаполнено(ТЗИсключающихМеток) Тогда
		Индекс = 0;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл		
			ДобавляемаяСтрокаТЗ = ТЗИсключающихМеток.Вставить(Индекс);
			ДобавляемаяСтрокаТЗ.Метка = Выборка.Метка;
			ДобавляемаяСтрокаТЗ.ЦветМетки = Выборка.ЦветМетки;			
			ДобавляемаяСтрокаТЗ.МеткаПациента = Ложь;
			ДобавляемаяСтрокаТЗ.Активна = Ложь;
			ДобавляемаяСтрокаТЗ.ЦветТекстаБелый = Выборка.ЦветТекстаБелый;
			Индекс = Индекс + 1
		КонецЦикла;
		ТЗИсключающихМеток.Сортировать("МеткаПациента ВОЗР, Метка");
		Возврат ТЗИсключающихМеток;
	Иначе
		Возврат Запрос.Выполнить().Выгрузить(); // .ВыгрузитьКолонку("Метка")
	КонецЕсли;
						  
КонецФункции

// Функция вернет тектс оповещения о метках клиента
//
Функция ПолучитьОповещенияОМетках(КлиентСсылка,Период)Экспорт 
	
	Метки = РегистрыСведений.МеткиКлиентов.ПолучитьМеткиКлиента(КлиентСсылка,?(ЗначениеЗаполнено(Период),Период,ТекущаяДата()));
	
	ТекстСообщения = "";
	
	Для А = 0 По Метки.Количество()-1 Цикл
		
		Если Метки[А].Метка.БлокироватьОбслуживание ИЛИ Метки[А].Метка.ИнформироватьОСтатусе Тогда
						 
			ТекстСообщения = ТекстСообщения + " Метка клиента: "+Строка(Метки[А].Метка)+".";
			ТекстСообщения = ТекстСообщения + ?(Метки[А].Комментарий <> "" ," Комментарий: "+Метки[А].Комментарий,"");
		    ТекстСообщения = ТекстСообщения + ?(Метки[А].Метка.БлокироватьОбслуживание,". Любые операции запрещены!","");	    		
			ТекстСообщения = ТекстСообщения + Символы.ПС;
			
		КонецЕсли;	
			
	КонецЦикла;
	
	Возврат ТекстСообщения;
	
КонецФункции

// Функция вернет признак необходимости блокировки операций с клиентом
//
Функция ПроверитьНеобходимостьБлокировкиОперацийСКлиентом(КлиентСсылка,Период)Экспорт 
	
	Метки = РегистрыСведений.МеткиКлиентов.ПолучитьМеткиКлиента(КлиентСсылка,?(ЗначениеЗаполнено(Период),Период,ТекущаяДата()),Истина);
	
	Возврат ?(Метки.Количество()>0,Истина,Ложь);
	
КонецФункции

// Процедура - Очистить метки объекта
//
Процедура ОчиститьМеткиОбъекта(ОбъектСсылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ОбъектСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Клиент.Установить(ОбъектСсылка);
	Набор.Записать();
		
КонецПроцедуры
		
// Процедура - Получить и записать метки контрагента в предварительной записи
//
// Параметры:
//  КонтрагентСсылка -	Контрагент 
//  СобытиеСсылка	 - 	Предварительная запись
//  Период			 - 	Период отбора 
//  МеткиДляСобытия	 - 	Булево - Истина, если метки только для предв. записи 
//
Процедура ПолучитьИЗаписатьМеткиКонтрагентаВПредварительнойЗаписи(КонтрагентСсылка, СобытиеСсылка, Период = Неопределено, МеткиДляСобытия = Ложь) Экспорт
	
	МассивМеток = ПолучитьМеткиКлиента(КонтрагентСсылка, Период, МеткиДляСобытия).ВыгрузитьКолонку("Метка");	
	
	Если ЗначениеЗаполнено(МассивМеток) Тогда
		
		ЗаписьМетка = РегистрыСведений.МеткиКлиентов.СоздатьНаборЗаписей();
		ЗаписьМетка.Отбор.Клиент.Установить(СобытиеСсылка);
		
		Для Каждого Метка ИЗ МассивМеток Цикл			
			НоваяМетка = ЗаписьМетка.Добавить();
			НоваяМетка.Период       = ТекущаяДатаСеанса();
			НоваяМетка.Клиент       = СобытиеСсылка;
			НоваяМетка.Метка        = Метка;
			НоваяМетка.Автор        = ПараметрыСеанса.ТекущийПользователь;
			НоваяМетка.Активна      = Истина;			
		КонецЦикла;
		
		Попытка
			ЗаписьМетка.ОбменДанными.Загрузка = Истина;
			ЗаписьМетка.Записать(Истина);
		Исключение
			ЗаписьЖурналаРегистрации("Ошибка при сохранении меток в предварительной записи: "+ СобытиеСсылка, УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());	
		КонецПопытки;
		
	КонецЕсли;

КонецПроцедуры

// Процедура, копирует и сохраняет метки объекта.
//
// Параметры:
//  ОбъектИсточник	 - ДокументСсылка.Событие, СправочникСсылка.Контрагенты	 -  
//  ОбъектПриемник	 - ДокументСсылка.Событие, СправочникСсылка.Контрагенты	 - 
//
Процедура СкопироватьМеткиОбъекта(ОбъектИсточник, ОбъектПриемник) Экспорт 
	
	МассивМеток = ПолучитьАктивныеМеткиЗаписи(ОбъектИсточник);	
	
	Если ЗначениеЗаполнено(МассивМеток) Тогда
		
		ЗаписьМетка = РегистрыСведений.МеткиКлиентов.СоздатьНаборЗаписей();
		ЗаписьМетка.Отбор.Клиент.Установить(ОбъектПриемник);
		
		Для Каждого Метка ИЗ МассивМеток Цикл			
			НоваяМетка = ЗаписьМетка.Добавить();
			НоваяМетка.Период       = ТекущаяДатаСеанса();
			НоваяМетка.Клиент       = ОбъектПриемник;
			НоваяМетка.Метка        = Метка;
			НоваяМетка.Автор        = ПараметрыСеанса.ТекущийПользователь;
			НоваяМетка.Активна      = Истина;			
		КонецЦикла;
		
		Попытка
			ЗаписьМетка.ОбменДанными.Загрузка = Истина;
			ЗаписьМетка.Записать(Истина);
		Исключение
			ЗаписьЖурналаРегистрации("Ошибка при сохранении меток в предварительной записи: "+ ОбъектПриемник, УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());	
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры // СкопироватьМеткиОбъекта

// Процедура - Записать изменения меток.
//
// Параметры:
//  Событие		 - 	 - 
//  ТаблицаМеток - 	 - 
//
Процедура ЗаписатьИзмененияМеток(СобытиеОбъект, ТаблицаМеток) Экспорт
	
	Период = ТекущаяДатаСеанса();
	
	НаборЗаписей = РегистрыСведений.МеткиКлиентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Клиент.Установить(СобытиеОбъект.Ссылка);
	
	МеткаПервичногоДобавлена = Ложь;
	
	Для Каждого ДанныеМетки ИЗ ТаблицаМеток Цикл
		
		Если ДанныеМетки.Активна = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДанныеМетки.Метка = Справочники.Метки.Первичный Тогда
			МеткаПервичногоДобавлена = Истина;
		КонецЕсли;
		
		НоваяМетка			 = НаборЗаписей.Добавить();
		НоваяМетка.Период	 = Период;
		НоваяМетка.Клиент	 = СобытиеОбъект.Ссылка;
		НоваяМетка.Метка	 = ДанныеМетки.Метка;
		НоваяМетка.Автор	 = ПараметрыСеанса.ТекущийПользователь;
		НоваяМетка.Активна	 = Истина;
		
	КонецЦикла;
	
	Если МеткаПервичногоДобавлена = Ложь Тогда
		
		СтатусПациента = РегистрыСведений.СтатусыКонтрагентов.СтатусКонтрагента(СобытиеОбъект.Контрагент);
		
		Если СтатусПациента = Перечисления.СтатусыКонтрагентов.Потенциальный Или СтатусПациента = Неопределено Тогда
			
			НоваяМетка			 = НаборЗаписей.Добавить();
			НоваяМетка.Период	 = Период;
			НоваяМетка.Клиент	 = СобытиеОбъект.Ссылка;
			НоваяМетка.Метка	 = Справочники.Метки.Первичный;
			НоваяМетка.Автор	 = ПараметрыСеанса.ТекущийПользователь;
			НоваяМетка.Активна	 = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	НаборЗаписей.Записать(); 
	
КонецПроцедуры

#КонецОбласти
